.echo OFF

drop table if exists books;
drop table if exists verses;

create table books (
	_id integer NOT NULL primary key,
	name varchar NOT NULL,
	enName varchar
);

insert into books values (1, 'בראשית', 'Genesis');
insert into books values (2, 'שמות', 'Exodus');
insert into books values (3, 'ויקרא', 'Leviticus');
insert into books values (4, 'במדבר', 'Numbers');
insert into books values (5, 'דברים', 'Deuteronomy');

create table verses (
	_id integer NOT NULL primary key,
	bookId integer NOT NULL,
	chapter integer NOT NULL,
	verse integer NOT NULL,
	verseText varchar NOT NULL,
	verseTextEn varchar,
	foreign key (bookId) references books(_id) on delete cascade,
	UNIQUE (bookId, chapter, verse)
);

insert into verses values (52, 2, 12, 6, 'והיה לכם למשמרת עד ארבעה עשר יום לחדש הזה ושחטו אתו כל קהל עדת-ישראל בין הערבים', null);
insert into verses values (53, 2, 12, 8, 'ואכלו את-הבשר בלילה הזה צלי-אש ומצות על-מררים יאכלהו', null);
insert into verses values (75, 2, 13, 2, 'קדש-לי כל-בכור פטר כל-רחם בבני ישראל באדם ובבהמה לי הוא', null);
insert into verses values (78, 2, 13, 13, 'וכל-פטר חמר תפדה בשה ואם-לא תפדה וערפתו וכל בכור אדם בניך תפדה', null);
insert into verses values (1, 2, 20, 2, 'אנכי יקוק אלקיך אשר הוצאתיך מארץ מצרים מבית עבדים', null);
insert into verses values (76, 2, 22, 28, 'מלאתך ודמעך לא תאחר בכור בניך תתן-לי', null);
insert into verses values (49, 2, 23, 14, 'שלש רגלים תחג לי בשנה', null);
insert into verses values (50, 2, 23, 17, 'שלש פעמים בשנה יראה כ-זכורך אל-פני האדן יקוק', null);
insert into verses values (5, 2, 23, 25, 'ועבדתם את יקוק אלקיכם וברך את-לחמך ואת-מימיך והסרתי מחלה מקרבך', null);
insert into verses values (24, 2, 25, 30, 'ונתת על-השלחן לחם פנים לפני תמיד', null);
insert into verses values (22, 2, 27, 21, 'באהל מועד מחוץ לפרכת אשר על-העדת יערך אתו אהרן ובניו מערב עד-בקר לפני יקוק חקת עולם לדרתם מאת בני ישראל', null);
insert into verses values (30, 2, 28, 2, 'ועשית בגדי-קדש לאהרן אחיך לכבוד ולתפארת', null);
insert into verses values (85, 2, 29, 33, 'ואכלו אתם אשר כפר בהם למלא את-ידם לקדש אתם וזר לא-יאכל כי-קדש הם', null);
insert into verses values (25, 2, 30, 7, 'והקטיר עליו אהרן קטרת סמים בבקר בבקר בהיטיבו את-הנרת יקטירנה', null);
insert into verses values (21, 2, 30, 19, 'ורחצו אהרן ובניו ממנו את-ידיהם ואת-רגליהם', null);
insert into verses values (32, 2, 30, 31, 'ואל-בני ישארל תדבר לאמר שמן משחת-קדש יהיה זה לי לדרתיכם', null);
insert into verses values (77, 2, 34, 20, 'ופטר חמור תפדה בשה ואם-לא תפדה וערפתו כל בכור בניך תפדה ולא-יראו פני ריקם', null);
insert into verses values (17, 2, 25, 8, 'ועשו לי מקדש ושכנתי בתוכם', null);

insert into verses values (59, 3, 1, 3, 'אם-עלה קרבנו מן-הבקר זכר תמים יקריבנו אל-פתח אהל מועד יקריב אתו לרצנו לפמי יקוק', null);
insert into verses values (63, 3, 2, 1, 'ונפש כי-תקריב קרבן מנחה ליקוק סלת יהיה קרבנו ויצק עליה שמן ונתן עליה לבנה', null);
insert into verses values (58, 3, 2, 13, 'וכל-קרבן מנחתך במלח תמלח ולא תשבית מלח ברית אלקיך מעל מנחתך על כל-קרבנך תקריב מלח', null);
insert into verses values (64, 3, 4, 13, 'ואם כל-עדת ישראל ישגו ונעלם דבר מעיני הקהל ועשו אחת מכל-מצות יקוק אשר לא-תעשינה ואשמו', null);
insert into verses values (65, 3, 5, 1, 'ונפש כי-תחטא ושמעה קול אלה והוא עד או ראה או ידע אם-לוא יגיד ונשא עונו', null);
insert into verses values (68, 3, 5, 11, 'ואם-לא תשיג ידו לשתי תרים או לשני בני-יונה והביא את-קרבנו אשר חטא עשירת האפה סלת לחטאת לא-ישים עליה שמן ולא-יתן עליה לבנה כי חטאת היא', null);
insert into verses values (67, 3, 5, 15, 'נפש כי-תמעל מעל וחטאה בשגגה מקדשי יקוק והביא את-אשמו ליקוק איל תמים מן-הצאן בערכך כסף-שקלים בשקל-הקדש לאשם', null);
insert into verses values (66, 3, 5, 17, 'ואם-נפש כי תחטא ועשתה אחת מכל-מצות יקוק אשר לא תעשינה ולא-ידע ואשם ונשא עונו', null);
insert into verses values (27, 3, 6, 3, 'ולבש הכהן מדו בד ומכנסי-בד ילבש על-בשרו והרים את-הדשן אשר תאכל האש את-העלה על-המזבח ושמו אצל המזבח', null);
insert into verses values (26, 3, 6, 6, 'אש תמיד תוקד על-המזבח לא תכבה', null);
insert into verses values (84, 3, 6, 9, 'והנותרת ממנה יאכלו אהרן וביו מצות תאכל במקום קדש בחצר אהל-מועד יאכלוה', null);
insert into verses values (37, 3, 6, 13, 'זה קרבן אהרן ובניו אשר-יקריבו ליקוק ביום המשח אתו עשירת האפה סלת מנחה תמיד מחציתה בבקר ומחציתה בערב', null);
insert into verses values (60, 3, 6, 18, 'דבר אל-אהרן ואל-בניו לאמר זאת תורת החטאת במקום אשר תשחט העלה תשחט החטאת לפני יקוק קדש קדשים הוא', null);
insert into verses values (61, 3, 7, 1, 'וזאת תורת האשם קדש קדשים הוא', null);
insert into verses values (62, 3, 7, 11, 'וזאת תורת זבח השלמים אשר יקריב ליקוק', null);
insert into verses values (87, 3, 7, 17, 'והנותר מבשר הזבח ביום השלישי באש ישרף', null);
insert into verses values (86, 3, 7, 19, 'והבשר אשר-יגע בכל-טמא לא יאכל באש ישרף והבשר כל-טהור יאכל בשר', null);
insert into verses values (93, 3, 11, 29, 'וזה לכם הטמא בשרץ השרץ על-הארץ החלד והעכבר והצב למינהו', null);
insert into verses values (94, 3, 11, 34, 'מכל-האכל אשר יאכל אשר יבוא עליו מים יטמא וכל-משקה אשר ישתה בכל-כלי יטמא', null);
insert into verses values (92, 3, 11, 39, 'יכי-ימות מן-הבהמה אשר-היא לכם לאכלה הנגע בנבלתה יטמא עד-הערב', null);
insert into verses values (96, 3, 12, 2, 'דבר אל-בני ישראל לאמר אשה כי תזריע וילדה זכר וטמאה שבעת ימים כימי נדת דותה תטמא', null);
insert into verses values (72, 3, 12, 6, 'ובמלאת ימי טהרה לבן או לבת תביא כבש בן-שנתו לעלה ובן-יונה או-תר לחטאת אל-פתח אהל-מועד אל-הכהן', null);
insert into verses values (97, 3, 13, 3, 'וראה הכהן את-הנגע בעור-הבשר ושער בנגע הפך לבן ומראה הנגע עמק מעור בשרו נגע צרעת הוא וראהו הכהן וטמא אתו', null);
insert into verses values (98, 3, 13, 51, 'וראה את-נגע ביום השביעי כי-פשה הנגע בבגד או-בשתי או-בערב או בעור לכם אשר-יעשה העור למלאכה צרעת ממארת הנגע טמא הוא', null);
insert into verses values (105, 3, 14, 2, 'וזאת תהיה תורת המצרע ביום טהרתו והובא אל-הכהן', null);
insert into verses values (73, 3, 14, 10, 'וביום השמיני יקח שני-כבשים תמימים וכבשה אחת בת-שנתה תמימה ושלשה עשרנים סלת מנחה בלולה בשמן ולג אחד שמן', null);
insert into verses values (99, 3, 14, 44, 'ובא הכהן וראה והנה פשה הנגע בבית צרעת ממארת הוא בבית טמא הוא', null);
insert into verses values (100, 3, 15, 2, 'דברו אל-בני ישראל ואמרתם אלהם איש איש כי יהיה זה מבשרו זוהו טמא הוא', null);
insert into verses values (70, 3, 15, 13, 'וכי-יטהר הזב מזובו וספר לו שבעת ימים לטהרתו וכבס בגדיו ורחץ בשרו במים חיים וטהר', null);
insert into verses values (101, 3, 15, 16, 'ואיש כי-תצא ממנו שכבת-זרע ורחץ במים את-כל-בשרו וטמא עד-הערב', null);
insert into verses values (102, 3, 15, 19, 'ואשה כי-תהיה זבה דם יהיה זבה בבשרה שבעת ימים תהיה בנדתה וכל-הנגע בה יטמא עד-הערב', null);
insert into verses values (95, 3, 15, 25, 'ואשה כי-יזוב זוב דמה ימים רבים בלא עת-נדתה או כי-תזוב על-נדתה כל-ימי זוב טמאתה כימי נדתה תהיה טמאה הוא', null);
insert into verses values (71, 3, 15, 28, 'ואם-טהרה מזובה וספרה לה שבעת ימים ואחר תטהר', null);
insert into verses values (46, 3, 16, 3, 'בזאת יבא אהרן אל-הקדש בפר בן-בקר לחטאת ואיל לעלה', null);
insert into verses values (18, 3, 19, 30, 'את-שבתתי תשמרו ומקדשי תיראו וני יקוק', null);
insert into verses values (34, 3, 21, 3, 'ולאחתו הבתולה הקרובה אליו אשר לא-היתה לאיש לה חטמא', null);
insert into verses values (29, 3, 21, 8, 'וקדשתו כי-את-לחם אלקיך הוא מקריב קדש יהיה-לך כי קדוש אני יקוק מקדשכם', null);
insert into verses values (35, 3, 21, 13, 'והוא אשה בבתוליה יקח', null);
insert into verses values (57, 3, 22, 21, 'ואיש כי-יקריב זבח-שלמים ליקוק לפלא-נדר או לנדבה בבקר או בצאן תמים יהיה לרצון כל-מום לא יהיה-בו', null);
insert into verses values (7, 3, 22, 32, 'ולא תחללו את-שם קדשי ונקדשתי בתוך בני ישראל אני יקוק מקדשכם', null);
insert into verses values (40, 3, 23, 8, 'והקרבתם אשה ליקוק שבעת ימים ביום השביעי מקרא-קדש כל-מלאכת עבדה לא תעשו', null);
insert into verses values (41, 3, 23, 10, 'דבר אל-בני ישראל ואמרת אלהם כי-תבאו אל-הראץ אשר אני נתן לכם וקצרתם את-קצירה והבאתם את-עמר ראשית קצירכם אל-הכהן', null);
insert into verses values (43, 3, 23, 17, 'ממושבתיכם תביאו לחם תנופה שתים שני עשרנים סלת תהיינה חמץ תאפינה בכורים ליקוק', null);
insert into verses values (83, 3, 27, 10, 'לא יחלפינו ולא-ימיר אתו טוב ברע או-רע בטוב ואם-המר ימיר בהמה בבהמה והיה-הוא ותמורתו יהיה-קדש', null);
insert into verses values (74, 3, 27, 32, 'וכל-מעשר בקר וצאן כל אשר-יעבר תחת השבט העשירי יהיה-קדש ליקוק', null);

insert into verses values (28, 4, 5, 2, 'צו את-בני ישארל וישלחו מן-המחנה כל-צרוע וכל-זב וכל טמא לנפש', null);
insert into verses values (69, 4, 5, 7, 'והתודו את-חטאתם אשר עשו והשיב את-אשמו בראשו וחמישתו יסף עליו ונתן לאשר אשם לו', null);
insert into verses values (88, 4, 6, 5, 'כל-ימי נדר נזרו תער לא-יעבר על-ראשו עד-מלאת הימם אשר-יזיר ליקוק קדש יהיה גדל פרע שער ראשו', null);
insert into verses values (89, 4, 6, 9, 'וכי-ימות מת עליו בפתע פתאם וטמא ראש נזרו וגלח ראשו ביום טהרתו ביום השביעי יגלחנו', null);
insert into verses values (23, 4, 6, 23, 'דבר אל-רהרן ואל-בניו לאמר כה תברכו את-בני ישראל אמור להם', null);
insert into verses values (31, 4, 7, 9, 'ולבני קהת לא נתן כי-עבדת הקדש עלהם בכתף ישאו', null);
insert into verses values (54, 4, 9, 11, 'בחדש השני בארבעה עשר יום בין הערבים יעשו אתו על-מצות ומררים יאכלהו', null);
insert into verses values (55, 4, 10, 10, 'וביום שמלתכם ובמועדיכם ובראשי חדשיכם ותקעתם בחצצרת על עלתיכם ועל זבחי שלמיכם והיו לכם לזכרון לפני אלקיכם אני יקוק אלקיכם', null);
insert into verses values (11, 4, 15, 38, 'דבר אל-בני ישראל ואמרת אלהם ועשו להם ציצת על-כנפי בגדיהם לדרתם ונתנו על-ציצת הכנף פתיל תכלת', null);
insert into verses values (19, 4, 18, 2, 'וגם את-אחיך מטה לוי שבט אביך הקרב אתך וילוו עליך וישמרתוך ואתה ובינך אתך לפני אהל העדת', null);
insert into verses values (20, 4, 18, 23, 'ועבד הלוי הוא את-עבדת אהל מועד והם ישאו עונם חקת עולם לגרתיכם ובתוך בני ישראל לא ינחלו נחלה', null);
insert into verses values (103, 4, 19, 11, 'הנגע במת לכל-נפש אדם וטמא שבעת ימים', null);
insert into verses values (104, 4, 19, 19, 'והזה הטהר על-הטמא ביום השלישי והיום השביעי וחטאו ביום השביעי וכבס בגדיו ורחץ במים וטהר בערב', null);
insert into verses values (56, 4, 22, 27, 'שור אן-כשב או-עז כי יולד והיה שבעת ימים תחת אמו ומיום השמיני והלאה ירצה לקרבן אשה ליקוק', null);
insert into verses values (36, 4, 28, 3, 'ואמרת להם זה האשה אשר תקריבו ליקוק כבשים בני-שנה תמימם שנים ליום עלה תמיד', null);
insert into verses values (38, 4, 28, 9, 'וביום השבת שני-כבשים בני-שנה תמימם ושני עשרנים סלת מנחה בלולה בשמן ונסכו', null);
insert into verses values (39, 4, 28, 11, 'ובראשי חדשיכם תקריבו עלה ליקוק פרים בני-בקר שנים ואיל אחד כבשים בני-שנה שבעה תמימם', null);
insert into verses values (42, 4, 28, 26, 'וביום הבכורים בהקריבכם מנחה חדשה ליקוק בשבעתיכם מקרא-קדש יהיה לכם כל-מלאכת עבדה לא תעשו', null);
insert into verses values (44, 4, 29, 2, 'ועשיתם עלה לריח ניחח ליקוק פר בן-בקר אחד איל אחד כבשים בני-שנה שבעה תמימם', null);
insert into verses values (45, 4, 29, 8, 'והקרבתם עלה ליקוק ריח ניחח פר בן-בקר אחד איל אחד כבשים בני-שנה שבעה תמימם יהיו לכם', null);
insert into verses values (47, 4, 29, 13, 'והקרבתם עלה אשה ריח ניחח ליקוק פרים בני-בקר שלשה עשר אילם שנים כבשים בני-שנה ארבעה עשר תמימם יהיו', null);
insert into verses values (48, 4, 29, 36, 'והקרבתם עלה אשה ריח ניחח ליקוק פר אחד איל אחד כבשים בני-שנה שבעה תמימם', null);
insert into verses values (91, 4, 30, 2, 'וידבר משה אל-ראשי המטות לבני ישראל לאמר זה הדבר אשר צוה יקוק', null);

insert into verses values (2, 5, 6, 4, 'שמע ישראל יקוק אלקינו יקוק אחד', null);
insert into verses values (3, 5, 6, 5, 'ואהבת את יקוק אלקיך בכל-לבבך ובכל-נפשך ובכל-מאדך', null);
insert into verses values (8, 5, 6, 7, 'ושננתם לבניך ודברת בם בשבתך בביתך ובלכתך בדרך ובשכבך ובקומך', null);
insert into verses values (10, 5, 6, 8, 'וקשרתם לאות על-ידך והיו לטטפת בין עיניך', null);
insert into verses values (12, 5, 6, 9, 'וכתבתם על-מזוזת ביתך ובשעריך', null);
insert into verses values (4, 5, 6, 13, 'את-יקוק אלקיך תירא ואתו תעבד ובשמו תשבע', null);
insert into verses values (16, 5, 8, 10, 'ואכלת ושבעת וברכת את-יקוק אלקיך על-הראץ הטבה אשר נתן-לך', null);
insert into verses values (9, 5, 10, 20, 'את-יקוק אלקיך תירא אתו תעבד ובו תדבק ובשמו תשבע', null);
insert into verses values (79, 5, 12, 5, 'כי אם-אל-המקום אשר-יבחר יקוק אלקיכם מכל-שבטיכם לשום את-שמו שם לשכנו תדרשו ובאת שמה', null);
insert into verses values (80, 5, 12, 14, 'כי אם במקום אשר-יבחר יקוק באחד שבטיך שם תעלה עלתיך ושם תעשה כל אשר אנכי מצוך', null);
insert into verses values (82, 5, 12, 15, 'רק בכל-אות נפשך תזבח ואכלת בשר בכרכת יקוק אלקיך אשר נתן-לך בכל-שעריך והטהור יאכלנו כצבה וכאיל', null);
insert into verses values (81, 5, 12, 26, 'רק קדשך אשר-יהיו לך ונדריך תשע ובאת אל-המקום אשר-יבחר יקוק', null);
insert into verses values (51, 5, 16, 14, 'ושמחת בחגך אתה ובנך ובתך ועבדך ואמתך והלוי והגר והיתום והאלמנה אשר בשעריך', null);
insert into verses values (15, 5, 17, 18, 'והיה כבשתו על כסא ממלכתו וכתב לו את-משנה התורה הזאת על-ספר מלפני הכהנים הלוים', null);
insert into verses values (33, 5, 18, 6, 'וכי-יבא הלוי מאחד שעריך מכל-ישראל אשר-הוא גר דם ובא בכל-אות נפשו אל-המקום אשר-יבחר יקוק', null);
insert into verses values (90, 5, 23, 24, 'מוצא פשתיך תשמר ועית כאשר נדרת ליקוק אלקיך נדבה אשר דברת בפיך', null);
insert into verses values (6, 5, 28, 9, 'יקימך יקוק לו לעם קדוש כאשר נשבע-לך כי תשמר את-מצות יקוק אלקיך והלכת בדרכיו', null);
insert into verses values (13, 5, 31, 12, 'הקהל את-העם האנשים והנשים והטף וגרך אשר בשעריך למען ישמעו ולמען ילמדו ויראו את-יקוק אלקיכם ושמרו לעשות אל-כל-דברי התורה הזאת', null);
insert into verses values (14, 5, 31, 19, 'ועתה כתבו לכם את-השירה הזאת ולמדה את-בני-ישראל שימה בפיהם למען תהיה-לי השירה הזאת לעד בבני ישראל', null);